monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
#include "ch32fun.h"
#include <stdio.h>
#include <string.h>
#include <stdbool.h>

#define DEBUG_LEVEL 1

#define NODE_ID 0xac
#define SPI_TRANSMISSION_TIMEOUT 10000
#define SPI_POLLING_INTERVAL 1500
#define ENUM_REQUEST_DELAY 3000
#define SPI_FORCED_SENDING 0 // Send even if we don't know any nodes
#define SPI_ENABLE_POLLING 1 // Periodically send empty messages on Master to receive any pending data from Slave

#if CH32V20x == 1
#define LED PB2
#define BUTTON PA0
#define BUTTON_POLARITY 1
#define LED_ON 1
#elif CH32V30x == 1
#define LED PA15
#define BUTTON PB3
#define BUTTON_POLARITY 0
#define LED_ON 1
#else
#define LED PC8
#define BUTTON PC0
#define BUTTON_POLARITY 1
#define LED_ON 0
#endif

#if BUTTON_POLARITY
#define READ_BUTTON funDigitalRead(BUTTON)
#else
#define READ_BUTTON !funDigitalRead(BUTTON)
#endif

#define BUTTON_SEND_DELAY 1000

#define MAX_NODES_N 64 // Maximum nodes number in the chain
#if (MAX_NODES_N > 255)
#error "You can have only 255 nodes max"
#endif

#define reloadTimer(x, y) x = SysTick->CNT + Ticks_from_Ms(y)
#define checkTimer(x) (int64_t)(SysTick->CNT - x) > 0

#define DMA_BASE_ADDR(n)  (DMA1_Channel1_BASE+(0x14*(n-1)))
#define DMA1_CH(n) ((DMA_Channel_TypeDef *)DMA_BASE_ADDR(n))
#define DMA1_IRQ(x) DMA1_Channel1_IRQn + x - 1

#define SPI1_CS1 PA4
#define SPI2_CS1 PB12

#define SPI_Master 1
#define SPI_Slave 0

#define DMA_In 0
#define DMA_Out 1

#define PACKET_SIZE 10
#define BUFFER_SIZE PACKET_SIZE*10

typedef enum {
	SPI_IDLE,
	SPI_POLLING,
	SPI_IN_PROGRESS,
	SPI_DONE,
} transfer_t;

typedef enum {
	CMD_IDLE = 0,
	CMD_ENUM_REQUEST = 0x11,
	CMD_ENUM_UPDATE = 0x12,
	CMD_ENUM_REPLY = 0x13,
	CMD_READ_SENSOR = 0x21,
	CMD_LED_TOGGLE = 0x31,
	CMD_LED_ON = 0x32,
	CMD_LED_OFF = 0x33,
} command_t;

struct command_struct {
	command_t type;
	uint16_t msg_number;
};

typedef enum {
	ENUM_EMPTY = 0,
	ENUM_WAIT = 1,
	ENUM_DONE = 2,
	ENUM_INIT,
	ENUM_CHANGED,
} enumeration_t;

typedef struct {
	__attribute__ ((aligned(4))) uint8_t in[BUFFER_SIZE+1];
	__attribute__ ((aligned(4))) uint8_t out[BUFFER_SIZE+1];
	volatile uint32_t pos_out; // Position in the array for the next packet to be placed at
	volatile uint32_t pos_in;
	volatile uint32_t sending_pos; // Position we are actually reading data from during send
	volatile uint32_t receiving_pos; // or writing to during receive
} buffer_t;

typedef struct {
	uint8_t map[MAX_NODES_N - 1];
	uint8_t n_nodes;
} node_map_t;

typedef struct spi {
	SPI_TypeDef * addr;
	DMA_Channel_TypeDef * dma_in;
	DMA_Channel_TypeDef * dma_out;
	uint32_t cs_pin;
	buffer_t * buffer;
	struct spi * another;
	volatile transfer_t transmission; // Current SPI transmission status
	volatile enumeration_t enumeration_state;
	node_map_t nodes;
	uint16_t message_number;
	struct command_struct in_pending_command;
	struct command_struct out_pending_command;
	volatile uint8_t incoming_message[PACKET_SIZE];
	uint8_t previous_out_message[PACKET_SIZE]; // Save previous message to be able to repeat it if receiver NAKs
	volatile int transmission_size; // Number of packets received in last transmission and to be processed
	int16_t incoming_message_pos;
	uint8_t master;
} spi_t;

buffer_t buffer;
buffer_t buffer_spi1;
buffer_t buffer_spi2;

spi_t spi2;

spi_t spi1 = {
	SPI1,
	DMA1_Channel2,
	DMA1_Channel3,
	SPI1_CS1,
	&buffer_spi1,
	&spi2,
	SPI_IDLE,
};

spi_t spi2 = {
	SPI2,
	DMA1_Channel4,
	DMA1_Channel5,
	SPI2_CS1,
	&buffer_spi2,
	&spi1,
	SPI_IDLE,
};

spi_t* spi_master = &spi1;
spi_t* spi_slave = &spi2;

uint64_t timer = 0;
uint64_t enum_timer = 0;
uint64_t polling_timer = 0;
uint64_t button_debounce_timer = 0;
uint64_t button_timer = 0;
bool last_button_state = false;
volatile bool needs_process = false;

void process_incoming(spi_t * spi) {
	// Make local copies because new transmission can mess everything up
	__disable_irq();
	uint32_t transfer_size = spi->transmission_size;
	uint32_t local_pos_in = spi->buffer->pos_in;
	uint32_t local_receiving_pos = spi->buffer->receiving_pos;
	needs_process = false;
	__enable_irq();

	// Now we need to find a new position in buffer for next transmission
	if (!spi->master) {
		spi->buffer->pos_in = local_receiving_pos; 
		if (local_receiving_pos > local_pos_in) transfer_size = local_receiving_pos - local_pos_in;
		else transfer_size = local_receiving_pos + (BUFFER_SIZE - local_pos_in);
	} else {
		// Calculating how many bytes we actually received
		// If we use DMA better rely on it's counter
		if (spi->dma_in->CFGR & DMA_CFGR1_EN) {

			uint32_t new_pos_in = BUFFER_SIZE - spi->dma_in->CNTR;
			if (new_pos_in > spi->buffer->pos_in) {
				transfer_size = (new_pos_in - spi->buffer->pos_in);
			} else {
				transfer_size = (new_pos_in + (BUFFER_SIZE - spi->buffer->pos_in));
			}
			spi->transmission_size = transfer_size;
			
			spi->buffer->pos_in = new_pos_in;
		}
	}

	for (int i = 0; i < transfer_size; i += PACKET_SIZE) {
		if (i) local_pos_in += PACKET_SIZE;
#if DEBUG_LEVEL > 1
		printf("Processing %s: [%ld] %02x %02x %02x %02x %02x %02x %02x %02x\n", (spi->master?"Master":"Slave"), local_pos_in);
		for (int n = 0; n < PACKET_SIZE; n++) {
			printf("%02x ", spi->buffer->in[local_pos_in+n]);
		}
		printf("\n");
#endif
		if (local_pos_in >= BUFFER_SIZE) local_pos_in -= BUFFER_SIZE; // Loop back in buffer
		if (spi->buffer->in[local_pos_in] == 0) continue; // Skip message if sender field is blank
		
		// Initialize enumeration or reset the one if node map is already filled
		// For this we check for messages from a direct neighbor - receiver_id = 0
		// And also check if sender_id have changed compared to what's in nodes.map
		if (spi->buffer->in[local_pos_in + 1] == 0 && spi->nodes.map[0] != spi->buffer->in[local_pos_in]) {
			spi->nodes.map[0] = spi->buffer->in[local_pos_in];
			spi->enumeration_state = ENUM_INIT;
			spi->nodes.n_nodes = 1; // We can only be sure about the neighboring node now
		}

		if (!(spi->buffer->in[local_pos_in+2]|spi->buffer->in[local_pos_in+3])) { // Skip also if message number field is empty
			continue;
		}

		uint8_t inc_id = spi->buffer->in[local_pos_in + 1];
		// If this message is intended for this node, or is a broadcast
		if (inc_id == NODE_ID || inc_id == 0 || inc_id == 0xff) {
			if (spi->incoming_message_pos < 0) {
				spi->incoming_message_pos = local_pos_in;
			}
		// Else pass message further
		} 
#if (SPI_FORCED_SENDING)
		else {
#else
		else if (spi->another->nodes.n_nodes) {
#endif
			// Copy message to another SPI's OUT buffer
			memcpy(&spi->another->buffer->out[spi->another->buffer->pos_out], &spi->buffer->in[local_pos_in], PACKET_SIZE);
			if ((spi->another->buffer->pos_out += PACKET_SIZE) >= BUFFER_SIZE) spi->another->buffer->pos_out = 0;
		}
	}
}

__attribute__((interrupt)) void DMA1_Channel3_IRQHandler( void ) 
{
	if (DMA1->INTFR & DMA1_IT_TC3) {
		DMA1_CH(3)->CFGR &= ~DMA_CFGR1_EN; // Disable OUT DMA
		if (spi1.transmission != SPI_IDLE) spi1.transmission = SPI_DONE; // Notify main
	}
	DMA1->INTFCR = DMA1_IT_GL3 | DMA1_IT_GL2; // Clear all interrupt flags for both DMA channels for SPI1
}

