monte-monte/ch32v003fun/examples_v20x/spi_dma_chain/spi_dma_chain.c
__attribute__((interrupt)) void DMA1_Channel5_IRQHandler(void) {
	if (DMA1->INTFR & DMA1_IT_TC5) {
		DMA1_CH(5)->CFGR &= ~DMA_CFGR1_EN;
		if (spi2.transmission != SPI_IDLE) spi2.transmission = SPI_DONE;
	}
	DMA1->INTFCR = DMA1_IT_GL4 | DMA1_IT_GL5; // Clear all interrupt flags for both DMA channels for SPI2
}

// GCC (with -Os) ignores inline keyword here, if you really want you have to use "__attribute__((always_inline))"
// __attribute__((always_inline)) static inline void spi_nodma_transmission(spi_t * spi, uint8_t * buf, uint32_t len) {
void spi_nodma_transmission(spi_t * spi, uint8_t * buf, uint32_t len) {
	uint32_t timeout = SPI_TRANSMISSION_TIMEOUT;
	uint32_t sent = 0;
	uint32_t received = 0;

	if (buf && len == 0) buf = NULL;
	if (buf == NULL) {
		len = spi->buffer->pos_out + (BUFFER_SIZE - spi->buffer->sending_pos);
		if (len >= BUFFER_SIZE) len -= BUFFER_SIZE;
	}

	while (timeout--) {
		// If SPI slave, we only run this function in interrupt
		if (((spi->addr->STATR & SPI_STATR_TXE) && len) || !sent) {
			// Write byte from buffer
			if (!len && !sent) {
				// By default always send node ID in the first byte of transmission
				// to indicate to master that there is node connected.
				// Otherwise receiver will read all zeroes and won't know if there is active node here.
				spi->addr->DATAR = (uint8_t)NODE_ID;
				ADD_N_NOPS(2);
				spi->addr->DATAR = 0;
			} else if (buf == NULL) {
				spi->addr->DATAR = spi->buffer->out[spi->buffer->sending_pos++];
				if (spi->buffer->sending_pos >= BUFFER_SIZE) spi->buffer->sending_pos = 0;
				len--;
			} else {
				spi->addr->DATAR = buf[sent];
				len--;
			}
			// if (!len) spi->addr->DATAR = 0; // Clear the buffer, or it last value will be sent continuously
			timeout = SPI_TRANSMISSION_TIMEOUT; // Reload timeout
			sent++;
		}

		if ((spi->addr->STATR & SPI_STATR_RXNE)) {
			// Read from SPI to a buffer
			spi->buffer->in[spi->buffer->receiving_pos++] = spi->addr->DATAR;
			if (spi->buffer->receiving_pos >= BUFFER_SIZE) spi->buffer->receiving_pos = 0;
			timeout = SPI_TRANSMISSION_TIMEOUT;
			received++;
			// If out buffer is already empty, but we now receiving extra packet.
			// Clear DATAR or we will sent garbage (last byte over an over).
			if (!len && received == PACKET_SIZE+1) spi->addr->DATAR = 0;
		}

		if (!spi->master && funDigitalRead(spi->cs_pin)) {
			break;
		}
		// If SPI master, we only run while there is something to send, or until timeout if POLLING
		if (spi->master && (!len) && spi->transmission != SPI_POLLING) break;
	}

	spi->buffer->sending_pos = PACKET_SIZE * (spi->buffer->sending_pos / PACKET_SIZE); // Align position to the packet start for next transmission
	spi->transmission_size = received;
	if (received < PACKET_SIZE) spi->transmission_size = PACKET_SIZE;

	// If we actually received anything, set flag to process incoming buffer
	// Previously we called a function directly, but it was messing with SPI timings (holding up IRQ for too long)
	if (received) {
		needs_process = true;
	}

	EXTI->INTFR = 1 << (spi->cs_pin % 16);
}

// All EXTI handlers are declared to be able to easily change trigger pin with a function.
// On practice it is recommended to leave only the one handler that is actually being use. It will save ~400B of flash.
// Also without "__attribute__((always_inline))" or "-fno-ipa-icf-functions" in gcc options,
// this way of declaring interrupt handlers produced unexpected and unwanted results.
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI0_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI1_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI2_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI3_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI4_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI9_5_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }
__attribute__((interrupt)) __attribute__((always_inline)) void EXTI15_10_IRQHandler( void ) { spi_nodma_transmission(spi_slave, NULL, 0); }

static inline void setupEXTI(uint8_t pin, uint8_t rising) {
	uint8_t port = (uint8_t)(pin / 16);
	pin = pin%16;
	uint8_t exti = (uint8_t)(pin / 4);

	AFIO->EXTICR[exti] |= port;

	if (rising) {
		EXTI->RTENR |= 1 << pin; // enable rising edge trigger
		EXTI->FTENR &= ~(1 << pin); // disable falling edge trigger
	} else {
		EXTI->RTENR &= ~(1 << pin); // disable rising edge trigger
		EXTI->FTENR |= 1 << pin; // enable falling edge trigger
	}

	IRQn_Type irqn;
	if (pin < 5) irqn = (IRQn_Type)((uint8_t)EXTI0_IRQn + pin);
	else if (pin < 10) irqn = EXTI9_5_IRQn;
	else irqn = EXTI15_10_IRQn;

	// printf("exti priority %02x\n", NVIC);
	NVIC_EnableIRQ(irqn);
#if defined(FUNCONF_ENABLE_HPE) && FUNCONF_ENABLE_HPE
	NVIC_SetPriority(irqn, 0<<7); // Set HIGH preemptive priority for the IRQ
#endif
	EXTI->INTENR |= 1 << pin; // Enable EXTIx interrupt
}

void setupDMA(uint8_t ch, SPI_TypeDef * spi, uint8_t mode, uint8_t sixteen_bits, uint8_t* buffer)
{
	RCC->AHBPCENR |= RCC_AHBPeriph_DMA1;

	DMA1_CH(ch)->PADDR = (uint32_t)&spi->DATAR;
	DMA1_CH(ch)->MADDR = (uint32_t)buffer;
	DMA1_CH(ch)->CNTR  = (mode?0:BUFFER_SIZE);
	DMA1_CH(ch)->CFGR  =
		DMA_M2M_Disable |
		(mode?DMA_Priority_VeryHigh:DMA_Priority_High) |
		(sixteen_bits?DMA_MemoryDataSize_Word:DMA_MemoryDataSize_Byte) |
		(sixteen_bits?DMA_PeripheralDataSize_Word:DMA_PeripheralDataSize_Byte) |
		DMA_MemoryInc_Enable |
		(mode?DMA_Mode_Normal:DMA_Mode_Circular) |
		(mode?DMA_DIR_PeripheralDST:DMA_DIR_PeripheralSRC) |
		(mode?DMA_IT_TC:0);

	if (mode) {
		NVIC_EnableIRQ( DMA1_IRQ(ch) );
#if defined(FUNCONF_ENABLE_HPE) && FUNCONF_ENABLE_HPE && (TARGET_MCU!=CH32V103)
		NVIC_SetPriority(DMA1_IRQ(ch), 1<<7);
#endif
	}
	DMA1_CH(ch)->CFGR |= DMA_CFGR1_EN;
}

